# а Список кількосіт бананів h кількість годин 
def min_k(a, h): # Повертає мінімальне ціле значення K
    if not a or h <= 0: # Перевірка вхідних данних якщо не вірно стоп і кидає помилку 
        raise ValueError("bad input")

    l, r = 1, max(a) # Межі для бінарного пошуку 

    # need(k) рахує години при швидкості k; бінарним пошуком знаходимо мінімальне k, щоб годин було <= h
    def need(k): # функція, яка для заданої швидкості k рахує, скільки годин потрібно, щоб з’їсти всі купки
        s = 0 # s лічильник годин, змінна для накопичення загальної кількості годин
        for x in a:#перебираємо кожну купку (кошик) з x бананів
            s += (x + k - 1) // k # K шивдкість поїдання, додаємо години, потрібні на цю купку при швидкості k 
            if s > h:# кщо вже вийшло більше годин, ніж дозволено h, одразу повертаємо
                return s #якщо всі купки пораховані і ліміт не перевищено, повертаємо загальну кількість годин.
        return s

    while l < r: # межі бінарного пошуку, поки межі пошуку не зійшлися, продовжуємо шукати відповідь
        m = (l + r) // 2 #беремо середину діапазону, пробну швидкість m
        if need(m) <= h: #перевіряємо, чи встигає Джекі з такою швидкістю за h годин
            r = m # якщо встигає, пробуємо меншу швидкість зсуваємо верхню межу вниз
        else:
            l = m + 1# якщо не встигає, швидкість замала, підвищуємо мінімальну межу

    return l # коли l == r, це мінімальна швидкість, яка підходить

# знайти найменше ціле число K (бананів за годину), щоб за H годин Джекі змогла з’їсти всі банани з усіх кошиків.

# Бінарний пошук — це спосіб швидко знайти відповідь у відсортованому діапазоні: кожного кроку беремо середину, перевіряємо і відкидаємо половину варіантів (ліву або праву), поки не знайдемо потрібне.