class BinaryTree:  # пбінарне дерево
    def __init__(self, v: int):  # конструктор, приймає значення вузла
        self.v = v  # зберігаємо значення в вузлі
        self.l = None  # лівий нащадок спочатку відсутній
        self.r = None  # правий нащадок спочатку відсутній


def invert_binary_tree(t) -> BinaryTree:  # функція інвертує дерево і повертає корінь
    if t is None:  # якщо дерева немає
        return None  # повертаємо None

    t.l, t.r = t.r, t.l  # міняємо місцями лівого і правого нащадка

    invert_binary_tree(t.l)  # інвертуємо ліве піддерево після обміну
    invert_binary_tree(t.r)  # інвертуємо праве піддерево після обміну

    return t  # повертаємо корінь інвертованого дерева